# 二分法(binary search)是面试中常见的算法。如果你的学校有算法课，那么你可能已经学习过二分这个算法了。

# 但是很多同学在二分法的问题上，依然无法熟练掌握，以下问题经常会不断发生：

# 写出来的二分法总是死循环
# start + 1 < end 还是 start <= end 还是 start < end 总是搞不清楚
# start = mid + 1 还是 start = mid 也总是搞不清楚
# 在这一章的学习中，我们要会学到：

# 一个通用的二分模板
# 为什么会出现死循环
# 哪些题目可以用二分法来做
# 通过时间复杂度倒推算法的技巧
# 其他的 Log N 算法（倍增法，辗转相除法，快速幂算法）
# 先修内容有：

# 基本的二分法该如何写
# 第一个位置，最后一个位置该如何变化
# Big O，时间复杂度，空间复杂度
# 什么是递归，二分法用递归如何实现
# 内存中的栈空间和堆空间有什么区别
# 什么是 Stack Overflow，什么情况下会造成 Stack Overflow
# 补充内容有：

# 三步翻转法
# 递增矩阵找数
# 快速幂算法
# 辗转相除法
# LintCode 上的二分法题目
# 可以看到，二分的题目非常的多
# http: // www.lintcode.com/tag/binary-search
